-- Заполнение таблицы с заявками для Tracker SQL
insert into items (name)
values ('Реализовать панель для навигации по трекеру'),
       ('Исправить ошибку с перемещением по дереву каталогов в левой части окна'),
       ('Нужно завести темную тему в трекере'),
       ('Собрать отзывы и предложения по трекеру, расставить соответствующие задачи'),
       ('Добавить побольше тестовых заданий'),
       ('Тестовая задача для проверки отображения задач в дереве каталогов в левой части окна'),
       ('Переделать авторизацию с логинов на почты');